dev/Testing/SAHL.Testing.Services/SAHL.Testing.ComcorpServices.Tests/XML/WhenApplicationIsRoundRobinAssigned.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">http://comcorp.sahomeloans.com/ComcorpConnectorService/SAHLIntegrationService.svc/integration</To>
    <Action xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none" s:mustUnderstand="1">http://tempuri.org/ISAHLIntegrationService/Submit</Action>
  </s:Header>
  <s:Body>
    <SAHLRequest xmlns="http://tempuri.org/">
      <Application xmlns:a="http://schemas.datacontract.org/2004/07/SAHL.WCFServices.ComcorpConnector.Objects" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:ApplicationCode>5000302527</a:ApplicationCode>
        <a:CapitaliseFees>false</a:CapitaliseFees>
        <a:CashOutAmt>0</a:CashOutAmt>
        <a:CashOutReason />
        <a:CoApplicants />
        <a:ConsultantFirstName>Nicole</a:ConsultantFirstName>
        <a:ConsultantSurname>Olivier</a:ConsultantSurname>
        <a:DepositCash>117500</a:DepositCash>
        <a:DepositOther />
        <a:DepositSource>false</a:DepositSource>
        <a:DeveloperName />
        <a:DevelopmentName />
        <a:EstCostFees>0</a:EstCostFees>
        <a:HigherBond>400000</a:HigherBond>
        <a:InstalmentMethod>Debit Order</a:InstalmentMethod>
        <a:IsForADevelopment>false</a:IsForADevelopment>
        <a:LoanAmountRequired>300000</a:LoanAmountRequired>
        <a:MainApplicant>
          <a:AddressCityWork>UMHLANGA ROCKS</a:AddressCityWork>
          <a:AddressLine1Work>76 ARMSTRONG AVE</a:AddressLine1Work>
          <a:AddressSuburbWork>LA LUCIA</a:AddressSuburbWork>
          <a:AdminRescinded>0001-01-01T00:00:00</a:AdminRescinded>
          <a:AssetItems />
          <a:BankAccounts>
            <a:BankAccount>
              <a:AccountBranch>DOBSONVILLE SUPER AGENCY   656</a:AccountBranch>
              <a:AccountInstitution>FIRST NATIONAL BANK OF SOUTHERN AFRICA LIMITED</a:AccountInstitution>
              <a:AccountName>JR BLACK</a:AccountName>
              <a:AccountNumber>62418278900</a:AccountNumber>
              <a:AccountType>Current</a:AccountType>
              <a:IsBusinessAccount>false</a:IsBusinessAccount>
              <a:STDAccountBranchCode>251237</a:STDAccountBranchCode>
              <a:isMainAccount>true</a:isMainAccount>
            </a:BankAccount>
          </a:BankAccounts>
          <a:BusinessMember>false</a:BusinessMember>
          <a:Cellphone>0826698745</a:Cellphone>
          <a:CorrespondenceLanguage>ENGLISH</a:CorrespondenceLanguage>
          <a:CurrentEmploymentType>SALARIED</a:CurrentEmploymentType>
          <a:DateJoinedEmployer>2009-04-04T00:00:00</a:DateJoinedEmployer>
          <a:DateOfBirth>1980-02-01T00:00:00</a:DateOfBirth>
          <a:DateRehabilitated>0001-01-01T00:00:00</a:DateRehabilitated>
          <a:DateSalaryPaid>25</a:DateSalaryPaid>
          <a:DebtRearrangement>false</a:DebtRearrangement>
          <a:DeclaredInsolvent>false</a:DeclaredInsolvent>
          <a:EmailAddress>JACK@BLACK.COM</a:EmailAddress>
          <a:EmployeeMedicalAid>1800</a:EmployeeMedicalAid>
          <a:EmployeeNo />
          <a:EmployeePAYE>3650</a:EmployeePAYE>
          <a:EmployeePension>4000</a:EmployeePension>
          <a:EmployeeUIF>400</a:EmployeeUIF>
          <a:EmployerBusinessType>COMPANY</a:EmployerBusinessType>
          <a:EmployerEmail />
          <a:EmployerGrossMonthlySalary>34000</a:EmployerGrossMonthlySalary>
          <a:EmployerName>DERIVCO (PTY) LTD</a:EmployerName>
          <a:EmployerRemunerationType>SALARIED</a:EmployerRemunerationType>
          <a:EmploymentSector>IT AND ELECTRONICS</a:EmploymentSector>
          <a:EthnicGroup>WHITE</a:EthnicGroup>
          <a:ExpenditureItems>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>1800</a:ExpenditureAmount>
              <a:ExpenditureDesc>Insurance/funeral policies</a:ExpenditureDesc>
              <a:ExpenditureType>8</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>3000</a:ExpenditureAmount>
              <a:ExpenditureDesc>Food and groceries</a:ExpenditureDesc>
              <a:ExpenditureType>11</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>0</a:ExpenditureAmount>
              <a:ExpenditureDesc>Other Debt Repayment</a:ExpenditureDesc>
              <a:ExpenditureType>54</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription>Gym</a:CapturedDescription>
              <a:ExpenditureAmount>600</a:ExpenditureAmount>
              <a:ExpenditureDesc>Other Instalments</a:ExpenditureDesc>
              <a:ExpenditureType>50</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>1500</a:ExpenditureAmount>
              <a:ExpenditureDesc>Planned Savings</a:ExpenditureDesc>
              <a:ExpenditureType>9</a:ExpenditureType>
            </a:ExpenditureItem>
            <a:ExpenditureItem>
              <a:CapturedDescription />
              <a:ExpenditureAmount>9850</a:ExpenditureAmount>
              <a:ExpenditureDesc>Salary Deductions</a:ExpenditureDesc>
              <a:ExpenditureType>55</a:ExpenditureType>
            </a:ExpenditureItem>
          </a:ExpenditureItems>
          <a:FaxCode />
          <a:FaxNo />
          <a:FirstName>JACK ROBERT</a:FirstName>
          <a:Gender>MALE</a:Gender>
          <a:HomeLanguage>ENGLISH</a:HomeLanguage>
          <a:HomePhone />
          <a:HomePhoneCode />
          <a:IdentificationNo>8002015039181</a:IdentificationNo>
          <a:IncomeContributor>true</a:IncomeContributor>
          <a:IncomeItems>
            <a:IncomeItem>
              <a:CapturedDescription />
              <a:IncomeAmount>34000</a:IncomeAmount>
              <a:IncomeDesc>Basic Salary</a:IncomeDesc>
              <a:IncomeType>22</a:IncomeType>
            </a:IncomeItem>
            <a:IncomeItem>
              <a:CapturedDescription />
              <a:IncomeAmount>0</a:IncomeAmount>
              <a:IncomeDesc>Income from Investments</a:IncomeDesc>
              <a:IncomeType>53</a:IncomeType>
            </a:IncomeItem>
            <a:IncomeItem>
              <a:CapturedDescription />
              <a:IncomeAmount>0</a:IncomeAmount>
              <a:IncomeDesc>Commission and Overtime</a:IncomeDesc>
              <a:IncomeType>6</a:IncomeType>
            </a:IncomeItem>
          </a:IncomeItems>
          <a:IsUnderAdminOrder>false</a:IsUnderAdminOrder>
          <a:IsUnderDebtReview>false</a:IsUnderDebtReview>
          <a:JudgementIndicator>false</a:JudgementIndicator>
          <a:JudgementValue />
          <a:LiabilityItems />
          <a:MaritalStatus>Single</a:MaritalStatus>
          <a:MarketingConsumerLists>false</a:MarketingConsumerLists>
          <a:MarketingEmail>true</a:MarketingEmail>
          <a:MarketingFlyer>false</a:MarketingFlyer>
          <a:MarketingMagazine>false</a:MarketingMagazine>
          <a:MarketingMarketing>false</a:MarketingMarketing>
          <a:MarketingNewspaper>false</a:MarketingNewspaper>
          <a:MarketingOnline>false</a:MarketingOnline>
          <a:MarketingOther>false</a:MarketingOther>
          <a:MarketingRadio>false</a:MarketingRadio>
          <a:MarketingReferral>true</a:MarketingReferral>
          <a:MarketingSMS>false</a:MarketingSMS>
          <a:MarketingTV>false</a:MarketingTV>
          <a:MarketingTelemarketing>false</a:MarketingTelemarketing>
          <a:MarriedStatus>NONE</a:MarriedStatus>
          <a:MayDoCreditBureauEnquiry>true</a:MayDoCreditBureauEnquiry>
          <a:MemberCompanyName />
          <a:MemberCompanyNumber />
          <a:NetAssets />
          <a:Occupation>PROJECT MANAGER</a:Occupation>
          <a:PassportNo />
          <a:PermanentResident>true</a:PermanentResident>
          <a:PhysicalAddressCity>DURBAN</a:PhysicalAddressCity>
          <a:PhysicalAddressCode>4051</a:PhysicalAddressCode>
          <a:PhysicalAddressLine1>80 CHELSEA DRIVE</a:PhysicalAddressLine1>
          <a:PhysicalAddressLine2 />
          <a:PhysicalAddressSuburb>DURBAN NORTH</a:PhysicalAddressSuburb>
          <a:PhysicalCountry />
          <a:PhysicalProvince>KWAZULU NATAL</a:PhysicalProvince>
          <a:PostalAddressCity>DURBAN</a:PostalAddressCity>
          <a:PostalAddressCode>4051</a:PostalAddressCode>
          <a:PostalAddressLine1>80 CHELSEA DRIVE</a:PostalAddressLine1>
          <a:PostalAddressLine2 />
          <a:PostalAddressSuburb>DURBAN NORTH</a:PostalAddressSuburb>
          <a:PostalCodeWork>4051</a:PostalCodeWork>
          <a:PostalCountry />
          <a:PostalProvince>KWAZULU NATAL</a:PostalProvince>
          <a:PreferredContactDelivery>EMAIL</a:PreferredContactDelivery>
          <a:PreferredName>JACK</a:PreferredName>
          <a:PreviousEmployerName />
          <a:PreviousEmployerPeriod />
          <a:RelationshipType />
          <a:SACitizen>true</a:SACitizen>
          <a:SAHLDeclaration>false</a:SAHLDeclaration>
          <a:SAHLHighestQualification>UNIVERSITY DEGREE</a:SAHLHighestQualification>
          <a:SAHLIsSurety>false</a:SAHLIsSurety>
          <a:SAHLSACitizenType>SA CITIZEN</a:SAHLSACitizenType>
          <a:Surname>BLACK</a:Surname>
          <a:Title>MR</a:Title>
          <a:WorkPhone>5741145</a:WorkPhone>
          <a:WorkPhoneCode>031</a:WorkPhoneCode>
          <a:Spouse i:nil="true" />
        </a:MainApplicant>
        <a:NamePropertyRegistered>JACK ROBERT BLACK</a:NamePropertyRegistered>
        <a:OffPlanIndicator>false</a:OffPlanIndicator>
        <a:OutstandingLoan>0</a:OutstandingLoan>
        <a:ProductSelection>New Variable Loan</a:ProductSelection>
        <a:Property>
          <a:AddressCity>DURBAN</a:AddressCity>
          <a:AddressSuburb>GLENASHLEY</a:AddressSuburb>
          <a:ComplexName />
          <a:ContactCellphone>0824447589</a:ContactCellphone>
          <a:ContactName>PROPERTY VALUATIONS</a:ContactName>
          <a:PortionNo />
          <a:PostalCode>4051</a:PostalCode>
          <a:Province>KWAZULU NATAL</a:Province>
          <a:SellerIDNo>8002015016718</a:SellerIDNo>
          <a:StandErfNo>710</a:StandErfNo>
          <a:StreetName>DAVALLEN AVENUE</a:StreetName>
          <a:StreetNo>10</a:StreetNo>
          <a:UsePropertyAddressAsDomiciliumAddress>true</a:UsePropertyAddressAsDomiciliumAddress>
          <a:UsePropertyAddressAsLoanMailingAddress>true</a:UsePropertyAddressAsLoanMailingAddress>
        </a:Property>
        <a:PropertyMarketValue>500000</a:PropertyMarketValue>
        <a:PropertyPurchasePrice>500000</a:PropertyPurchasePrice>
        <a:QuickCashIndicator>false</a:QuickCashIndicator>
        <a:SAHLBondAccountNo>0</a:SAHLBondAccountNo>
        <a:SAHLOccupancyType>Owner Occupied</a:SAHLOccupancyType>
        <a:SAHLPropertyType>House</a:SAHLPropertyType>
        <a:SAHLTitleType>Freehold</a:SAHLTitleType>
        <a:SAHLVendorCode>SAHLTest01</a:SAHLVendorCode>
        <a:SahlLoanPurpose>New Purchase Loan</a:SahlLoanPurpose>
        <a:SahlTransferAtt>Brett Armstrong</a:SahlTransferAtt>
        <a:SectionalTitleUnitNo />
        <a:TermOfLoan>20</a:TermOfLoan>
        <a:TotalEstLoan>300000</a:TotalEstLoan>
      </Application>
    </SAHLRequest>
  </s:Body>
</s:Envelope>